FemDesign.Shells.Slab
slab_type

FemDesign.Shells.Slab.#ctor
Parameterless constructor for serialization.

FemDesign.Shells.Slab.#ctor(FemDesign.Shells.SlabType,System.String,FemDesign.Shells.SlabPart,FemDesign.Materials.Material)
Construct Slab.

FemDesign.Shells.Slab.Plate(System.Double,System.Double,System.Double,FemDesign.Materials.Material,FemDesign.Shells.EdgeConnection,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy,System.String)
Construct a rectangular slab in the XY plane
width:
height:
thickness:
material:
shellEdgeConnection:
eccentricity:
orthotropy:
identifier:
Returns:

FemDesign.Shells.Slab.Wall(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,System.Double,System.Double,FemDesign.Materials.Material,FemDesign.Shells.EdgeConnection,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy,System.String)
Construct a vertical wall from two points
point0:
point1:
height:
thickness:
material:
shellEdgeConnection:
eccentricity:
orthotropy:
identifier:
Returns:

FemDesign.Shells.Slab.FromFourPoints(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,System.Double,FemDesign.Materials.Material,FemDesign.Shells.EdgeConnection,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy,System.String)
Construct a slab from four points.
point0:
point1:
point2:
point3:
thickness:
material:
shellEdgeConnection:
eccentricity:
orthotropy:
identifier:
Returns:

FemDesign.Shells.Slab.Wall(System.Double,System.Double,System.Double,FemDesign.Materials.Material,FemDesign.Shells.EdgeConnection,FemDesign.Shells.ShellEccentricity,FemDesign.Shells.ShellOrthotropy,System.String)
Construct a Wall Element in XZ plane
width:
height:
thickness:
material:
shellEdgeConnection:
eccentricity:
orthotropy:
identifier:
Returns:

FemDesign.Shells.Slab.EdgeConnection(FemDesign.Shells.Slab,FemDesign.Shells.EdgeConnection,System.Collections.Generic.List{System.Int32})
Set EdgeConnections by indices.
slab: Slab.
shellEdgeConnection: EdgeConnection.
indices: Index. List of items. Use SlabDeconstruct to extract index for each respective edge.

FemDesign.Shells.Slab.EdgeConnection(FemDesign.Shells.Slab,FemDesign.Shells.EdgeConnection,System.Int32)
Set EdgeConnections by indices.
slab: Slab.
shellEdgeConnection: EdgeConnection.
index: Index of edge to set.

FemDesign.Shells.Slab.AverageSurfaceElementSize(FemDesign.Shells.Slab,System.Double)
Set average mesh size to slab.
Remarks: Action
slab: Slab.
avgMeshSize: Average mesh size.
Returns: